artillery/test-config.yml
config:
  target: "https://api.fileconversion.site"
  processor: "./processor.js"
  phases:
    - duration: 5
      arrivalRate: 5
      name: "예열 단계"

scenarios:
  - name: "변환 요청 + history"
    flow:
      - post:
          url: "/file/upload-init"
          beforeRequest: "generateRandomData"
          json:
            uuid: "{{ $uuid }}"
            targetFormat: "PDF"
            files:
              - filename: "{{ filename }}"
                contentType: "image/jpeg"
                size: 6132
          capture:
            - json: "$.items[0].uploadUrl"
              as: "capturedUploadUrl"
            - json: "$.items[0].historyId"
              as: "capturedHistoryId"
          expect:
            - statusCode: 200

      - put:
          url: "{{ capturedUploadUrl }}"
          body: "test content"
          headers:
            Content-Type: "image/jpeg"
          expect:
            - statusCode: 200

      - post:
          url: "/file/upload-complete"
          json:
            uuid: "{{ $uuid }}"
            historyIds: ["{{ capturedHistoryId }}"]
          expect:
            - statusCode: 200